---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructConnectionTypeName
source: html/e91c46e6-74e5-8322-5501-7d807447d6c0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructConnectionTypeName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId StructConnectionTypeName { get; }
```